/******************** (C) COPYRIGHT 2012 BOOLESION.NET ***************************
* 产品名称: 布尔创51开发板 E1101
* 文件名称: uart.c
* 程序作者: BOOLESION.NET 布尔创(BOOLESION)电子科技 - NETC (陈建长)
* 程序版本: V1.1
* 编制日期: 2012/01/20
* 功能描述: UART 串口驱动程序.
**********************************************************************************/

/* Includes ---------------------------------------------------------------------*/
#include "includes.h"

/* 变量声明 ---------------------------------------------------------------------*/

/*********************************************************************************
** 函数名称: void UartInit(void)	.
** 功能描述: 将串口波特率初始化为9600bps,未开串口接收中断.
** 输入参数: None.         
** 输出参数: None.
** 返回参数: None.
**********************************************************************************/
void UartInit(void)		/* 9600bps@22.1184MHz             */ 
{
	PCON &= 0x7f;		/* 波特率不倍速                   */
	SCON = 0x50;		/* 8位数据,可变波特率             */
	AUXR |= 0x40;		/* 定时器1时钟为Fosc,即1T         */
	AUXR &= 0xfe;		/* 串口1选择定时器1为波特率发生器 */
	TMOD &= 0x0f;		/* 清除定时器1模式位              */
	TMOD |= 0x20;		/* 设定定时器1为8位自动重装方式   */
	TL1 = 0xB8;		    /* 设定定时初值                   */
	TH1 = 0xB8;		    /* 设定定时器重装值               */
	ET1 = 0;		    /* 禁止定时器1中断                */
	TR1 = 1;		    /* 启动定时器1                    */
}

#if USE_TransmitByte 
/*********************************************************************************
** 函数名称: void TransmitByte (INT8U byte).
** 功能描述: 串口单个数据发送函数.
** 输入参数: 想要发送的数据,如果想发送a字母,就写UartSend('a').         
** 输出参数: None.
** 返回参数: None.
**********************************************************************************/
void TransmitByte (INT8U byte)
{
   SBUF=byte;
   while(!TI);
   TI=0;
}
#endif /* USE_TransmitByte */
/*********************************************************************************
** 函数名称: void TransmitString(INT8U *String).
** 功能描述: 串口多个数据发送函数.
** 输入参数: 想要发送的数据,如果想发送hello,就写TransmitString("hello").         
** 输出参数: None.
** 返回参数: None.
**********************************************************************************/
void TransmitString(INT8U *String)
{
   while(*String)
   {SBUF=*String++;
    while(!TI);
    TI=0;
   }
}
#if	USE_TransmitHex
/*********************************************************************************
** 函数名称: void TransmitHex(INT8U hex).
** 功能描述: 以16进制格式发送一个字节数据.
** 输入参数: INT8U hex 16进制格式.         
** 输出参数: None.
** 返回参数: None.
**********************************************************************************/
void TransmitHex(INT8U hex)
{
	INT8U i, temp;
	INT8U data dataString[] = "0x  ";

	for(i=2; i>0; i--)
	{
		temp = hex % 16;

		if((temp >= 0) && (temp < 10)) 
			dataString[i+1] = temp + 0x30; //'0'
		else 
			dataString[i+1] = (temp - 10) + 0x41;//'A'

		hex = hex/16;
	}
	TransmitString (dataString);
}
#endif	/* USE_TransmitHex */
