/******************** (C) COPYRIGHT 2012 BOOLESION.NET ***************************
* 产品名称: 布尔创51开发板 E1101
* 文件名称: guihelloworld.c
* 程序作者: BOOLESION.NET 布尔创(BOOLESION)电子科技 - NETC (陈建长)
* 程序版本: V1.2
* 编制日期: 2012/01/20
* 功能描述: 应用程序例子GUI.
**********************************************************************************/

/* Includes ---------------------------------------------------------------------*/
#include "includes.h"

/* 变量声明 ---------------------------------------------------------------------*/

extern volatile INT8U menuflag; /* 菜单标识 */ 

/*********************************************************************************
** 函数名称: void GUIHelloWorld(void).
** 功能描述: 应用程序例子GUI.
** 输入参数: None.         
** 输出参数: None.
** 返回参数: None.
**********************************************************************************/
void GUIHelloWorld(void)
{
	menuflag = MAINMENU_APP;                            /* 菜单标识 2 */

	CreateWindow("Hello World",30,30,330,165,White);	/* 创建窗口 */
}