/******************** (C) COPYRIGHT 2012 BOOLESION.NET ***************************
* 产品名称: 布尔创51开发板 E1101
* 文件名称: commonfun.c
* 程序作者: BOOLESION.NET 布尔创(BOOLESION)电子科技 - NETC (陈建长)
* 程序版本: V1.2
* 编制日期: 2012/01/20
* 功能描述: 公共函数.
**********************************************************************************/

/* Includes ---------------------------------------------------------------------*/
#include "includes.h"

/*********************************************************************************
** 函数名称: void UnionString(char* dest, char* s1, char* s2,char* s3).
** 功能描述: 合并字符串 s1 ,s2和 s3 .
** 输入参数: char* dest, char* s1, char* s2,char* s3.         
** 输出参数: char* dest.
** 返回参数: returnpath 文件路径.
**********************************************************************************/
void UnionString(char* dest, char* s1, char* s2,char* s3)
{
	 while (*dest++=*s1++);
	 dest--;
	 while (*dest++=*s2++);
	 dest--;
	 while (*dest++=*s3++);
}

/*********************************************************************************
** 函数名称: INT8U BcdToBin(INT8U val) .
** 功能描述: 将BCD码转换为10进制数 .
** 输入参数: INT8U val.         
** 输出参数: None.
** 返回参数: val 返回10进制数.
**********************************************************************************/
INT8U BcdToBin(INT8U val) 
{ 
  val = (val >> 4) * 10 + (val & 0x0f); /* 将BCD码转换为10进制数 */
  return val;                           /* 返回10进制数 */ 
} 


